app/views/account/sales_module/sales/_form.html.erb

  <div class="well">
    <%= sale_f.input :branch_id, :as => :select, :collection => Branch.all.map{ |b| [ b.name, b.id ] } %>
---
SELECT "branches".* FROM "branches"