app/views/account/sales_module/sales/show.html.erb

SELECT "sale_sale_categories".* FROM "sale_sale_categories" WHERE "sale_sale_categories"."sale_id" IN (1)
SELECT "sales".* FROM "sales" WHERE (sale_date_time >= '2012-07-01' and sale_date_time <= '2012-07-11')
---
            <% sale_categories_percentage = Array.new %>
            <% @sale.sale_sale_categories.each do |scr| %>

SELECT "sale_settlement_types".* FROM "sale_settlement_types" WHERE "sale_settlement_types"."sale_id" IN (1)
---
          <% settlement_type_percentage = Array.new %>
          <% @sale.sale_settlement_types.each do |sts| %>