app/views/account/setup_module/organization_setup/branches/_form.html.erb

SELECT "concepts".* FROM "concepts"
---
  <div class="well">
	<%= branch_f.input :concept_id, :as => :select, :collection => Concept.accessible_by(current_ability).all.map{ |b| [ b.name, b.id ] } %>