app/views/account/setup_module/organization_setup/client_users/_form.html.erb

SELECT "clients".* FROM "clients"
SELECT "concepts".* FROM "concepts" WHERE "concepts"."client_id" = 1 AND "concepts"."client_id" = 1
SELECT "branches".* FROM "branches" WHERE "branches"."client_id" = 1
---
  <div class="well">
    <%= client_f.input :client_id, :as => :select, :collection => Client.accessible_by(current_ability).all.map{ |b| [ b.name, b.id ] } %>
    <%= client_f.input :concept_id, :as => :select, :collection => Concept.accessible_by(current_ability).accessible_by(current_ability).all.map{ |b| [ b.name, b.id ] } %>
    <%= client_f.input :branch_id, :as => :select, :collection => Branch.accessible_by(current_ability).all.map{ |b| [ b.name, b.id ] } %>