app/controllers/account/setup_module/purchases_setup/suppliers_controller.rb

  def create
    @supplier = Supplier.new(params[:supplier])

    if @supplier.save
---
INSERT INTO "suppliers" ("address", "branch_id", "client_id", "concept_id", "contact_number", "contact_person", "contact_title", "created_at", "description", "email", "name", "tin", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"