app/views/account/setup_module/inventory_setup/conversions/_form.html.erb

SELECT "units".* FROM "units"
---
  <div class="well">
    <%= conversion_f.input :bigger_unit_id, :as => :select, :collection => Unit.all.map{ |b| [ b.name, b.id ] } %>