app/views/account/setup_module/inventory_setup/items/_form.html.erb

  <div class="well">
	<%= item_f.input :concept_id, :as => :select, :collection => Concept.all.map{ |b| [ b.name, b.id ] } %>
	<%= item_f.input :subcategory_id, :as => :select, :collection => Subcategory.all.map{ |b| [ b.name, b.id ] }%>
    <%= item_f.input :name %>
    <%= item_f.input :unit_id, :as => :select, :collection => Unit.all.map{ |b| [ b.name, b.id ] } %>
---
SELECT "concepts".* FROM "concepts"
SELECT "subcategories".* FROM "subcategories"
SELECT "units".* FROM "units"