app/controllers/account/purchases_module/purchases_controller.rb

  def create
    @purchase = Purchase.new(params[:purchase])

    if @purchase.save
---
INSERT INTO "purchases" ("branch_id", "client_id", "concept_id", "created_at", "creator_id", "invoice_number", "purchase_date", "supplier_id", "updated_at", "vat_type") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"