app/views/account/setup_module/sales_setup/settlement_types/_form.html.erb

SELECT "concepts".* FROM "concepts"
---
  <div class="well">
	<%= settlement_type_f.input :concept_id, :as => :select, :collection => Concept.accessible_by(current_ability).all.map{ |b| [ b.name, b.id ] } %>