app/views/account/reports_module/endcounts_reports/index.html.erb

                      <th colspan="3"><%= subcategory.name %></th>
                        <% subtotal_beginning_count = items.map(&:beginning_count).reject(&:nil?).inject(:+) %>
---
SELECT "item_counts".* FROM "item_counts" WHERE "item_counts"."item_id" = 1 AND (date_part('year', entry_date) = 2012 and date_part('month', entry_date) = 6) ORDER BY created_at DESC LIMIT 1