app/views/account/setup_module/organization_setup/concepts/_form.html.erb

  <div class="well">
	<%= concept_f.input :client_id, :as => :select, :collection => Client.accessible_by(current_ability).all.map{ |b| [ b.name, b.id ] } %>
---
SELECT "clients".* FROM "clients"