app/controllers/account/setup_module/organization_setup/branches_controller.rb

SELECT "branches".* FROM "branches" ORDER BY updated_at
---
  def index
    @branches = Branch.accessible_by(current_ability).order("updated_at")

SELECT "branches".* FROM "branches" WHERE "branches"."id" = 1 LIMIT 1
---
  def show
    @branch = Branch.find(params[:id])

SELECT "branches".* FROM "branches" WHERE "branches"."id" = 1 LIMIT 1
---
  def edit
    @branch = Branch.find(params[:id])

INSERT INTO "branches" ("address", "client_id", "concept_id", "contact_number", "created_at", "name", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @branch = Branch.new(params[:branch])

    if @branch.save