app/controllers/account/setup_module/organization_setup/clients_controller.rb

INSERT INTO "clients" ("address", "contact_number", "created_at", "name", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["address", ""], ["contact_number", ""], ["created_at", Mon, 16 Jul 2012 11:16:57 SGT +08:00], ["name", "Bistro Group"], ["updated_at", Mon, 16 Jul 2012 11:16:57 SGT +08:00]]
---
  def create
    @client = Client.new(params[:client])

    if @client.save