app/controllers/account/setup_module/organization_setup/client_users_controller.rb

  def index
    @client_users = ClientUser.accessible_by(current_ability).order("created_at")
---
SELECT "client_users".* FROM "client_users" WHERE "client_users"."client_id" = 1 ORDER BY created_at

  def show
    @client_user = ClientUser.find(params[:id])
---
SELECT "client_users".* FROM "client_users" WHERE "client_users"."id" = 1 LIMIT 1

  def edit
    @client_user = ClientUser.find(params[:id])
---
SELECT "client_users".* FROM "client_users" WHERE "client_users"."id" = 1 LIMIT 1

  def create
    @client_user = ClientUser.new(params[:client_user])

    if @client_user.save
---
INSERT INTO "client_users" ("branch_id", "client_id", "concept_id", "created_at", "current_sign_in_at", "current_sign_in_ip", "email", "encrypted_password", "first_name", "last_name", "last_sign_in_at", "last_sign_in_ip", "remember_created_at", "reset_password_sent_at", "reset_password_token", "role", "sign_in_count", "updated_at", "username") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19) RETURNING "id"