app/controllers/account/setup_module/organization_setup/concepts_controller.rb

SELECT "concepts".* FROM "concepts" WHERE "concepts"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    @concept = Concept.find(params[:id])

SELECT "concepts".* FROM "concepts" WHERE "concepts"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def edit
    @concept = Concept.find(params[:id])

INSERT INTO "concepts" ("address", "client_id", "contact_number", "created_at", "name", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["address", ""], ["client_id", 2], ["contact_number", ""], ["created_at", Mon, 16 Jul 2012 11:19:24 SGT +08:00], ["name", "Italianis"], ["updated_at", Mon, 16 Jul 2012 11:19:24 SGT +08:00]]
---
  def create
    @concept = Concept.new(params[:concept])

    if @concept.save