app/controllers/account/setup_module/organization_setup/roles_controller.rb

  def index
    @roles = Role.order("updated_at")
---
SELECT "roles".* FROM "roles" ORDER BY updated_at

  def show
    @role = Role.find(params[:id])
---
SELECT "roles".* FROM "roles" WHERE "roles"."id" = $1 LIMIT 1  [["id", "1"]]

  def edit
    @role = Role.find(params[:id])
---
SELECT "roles".* FROM "roles" WHERE "roles"."id" = $1 LIMIT 1  [["id", "1"]]

  def create
    @role = Role.new(params[:role])

    if @role.save
---
INSERT INTO "roles" ("branch_id", "client_id", "concept_id", "created_at", "name", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["branch_id", nil], ["client_id", nil], ["concept_id", nil], ["created_at", Tue, 17 Jul 2012 16:18:01 SGT +08:00], ["name", "Client"], ["updated_at", Tue, 17 Jul 2012 16:18:01 SGT +08:00]]

  def destroy
    @role = Concept.find(params[:id])
    @role.destroy
---
SELECT "concepts".* FROM "concepts" WHERE "concepts"."id" = $1 LIMIT 1  [["id", "2"]]
DELETE FROM "concepts" WHERE "concepts"."id" = $1  [["id", 2]]