app/controllers/account/sales_module/sales_controller.rb

  def show
    set_tab :sales_reports
    @sale = Sale.includes([:sale_sale_categories, :sale_settlement_types, :branch])
      .find(params[:id])
---
SELECT "branches".* FROM "branches" WHERE "branches"."id" IN (1)
SELECT "sale_categories".* FROM "sale_categories" WHERE "sale_categories"."id" = 1 LIMIT 1
SELECT "sale_sale_categories".* FROM "sale_sale_categories" WHERE "sale_sale_categories"."sale_id" IN (1)
SELECT "sale_settlement_types".* FROM "sale_settlement_types" WHERE "sale_settlement_types"."sale_id" IN (1)

  def new
    @sale = Sale.new
    categories = SaleCategory.order("updated_at")
    categories.each do |c|
      @sale.sale_sale_categories.build({:sale_category_id => c.id})
    end

    settlement_types = SettlementType.order("updated_at")
---
SELECT "sale_categories".* FROM "sale_categories" ORDER BY updated_at
SELECT "settlement_types".* FROM "settlement_types" ORDER BY updated_at

  def create
    @sale = Sale.new(params[:sale])

    if @sale.save
---
INSERT INTO "sales" ("branch_id", "cash_in_drawer", "created_at", "creator_id", "credit_card_transaction_count", "customer_count", "delivery_sales", "delivery_transaction_count", "gc_redeemed", "gc_sales", "other_income", "sale_date", "service_charge", "transaction_count", "updated_at", "vat") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16) RETURNING "id"