app/controllers/account/inventory_module/endcounts_controller.rb

SELECT "endcounts".* FROM "endcounts" ORDER BY updated_at
SELECT COUNT(*) FROM "endcounts" WHERE (( endcounts.branch_id = '2'))
SELECT "items".* FROM "items" WHERE (items.group != 'non-inventory') ORDER BY subcategory_id, name ASC
---
  def index
    set_tab :endcounts

    @endcounts = Endcount.order("updated_at")
    @endcounts_grid = initialize_grid(Endcount)

    @items = Item.where("items.group != ?", "non-inventory").order("subcategory_id, name ASC")

SELECT "endcounts".* FROM "endcounts" WHERE "endcounts"."id" = $1 LIMIT 1  [["id", "3"]]
SELECT "item_counts".* FROM "item_counts" WHERE "item_counts"."endcount_id" = 3
---
  def show
    set_tab :endcounts
    @endcount = Endcount.find(params[:id])

SELECT "items".* FROM "items" WHERE (items.group != 'non-inventory') ORDER BY subcategory_id, name ASC
---
  def new
    set_tab :endcounts_new

    @endcount = Endcount.new
    items = Item.where("items.group != ?", "non-inventory").order("subcategory_id, name ASC")

SELECT "endcounts".* FROM "endcounts" WHERE "endcounts"."id" = $1 LIMIT 1  [["id", "3"]]
SELECT "item_counts".* FROM "item_counts" WHERE "item_counts"."endcount_id" = 3
---
  def edit
    set_tab :endcounts
    @endcount = Endcount.find(params[:id])

INSERT INTO "endcounts" ("branch_id", "created_at", "entry_date", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["branch_id", 3], ["created_at", Tue, 10 Jul 2012 15:17:31 SGT +08:00], ["entry_date", Sun, 07 Oct 2012], ["updated_at", Tue, 10 Jul 2012 15:17:31 SGT +08:00]]
INSERT INTO "item_counts" ("branch_id", "client_id", "concept_id", "created_at", "endcount_id", "entry_date", "item_id", "stock_count", "unit_id", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @endcount = Endcount.new(params[:endcount])

    if @endcount.save