app/controllers/account/reports_module/directional_reports_controller.rb

  def index
    #if current_user.branch?
      #@branch = @current_branch
    #else
      #@branch = params[:branch_id] ? Branch.find(params[:branch_id]) : Branch.accessible_by(current_ability).first
    #end
    @branch = 1;
    @directional = Directional.new(Date.today.beginning_of_month, @ending_date, @branch)
    @settlement_type = SettlementType.all(:conditions => ["is_complimentary != ?", false])
---
SELECT "settlement_types".* FROM "settlement_types" WHERE (is_complimentary != 'f')