app/controllers/account/reports_module/purchases_reports_controller.rb

SELECT "purchases".* FROM "purchases" ORDER BY updated_at
SELECT "purchase_items".* FROM "purchase_items" ORDER BY updated_at
---
  def index
    @purchases = Purchase.order("updated_at")
    @purchase_items = PurchaseItem.order("updated_at")