app/controllers/account/setup_module/inventory_setup/categories_controller.rb

INSERT INTO "categories" ("client_id", "concept_id", "created_at", "description", "name", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["client_id", nil], ["concept_id", 1], ["created_at", Mon, 16 Jul 2012 09:59:55 SGT +08:00], ["description", "food"], ["name", "Food"], ["updated_at", Mon, 16 Jul 2012 09:59:55 SGT +08:00]]
---
  def create
    @category = Category.new(params[:category])

    if @category.save