app/controllers/account/setup_module/inventory_setup/conversions_controller.rb

  def create
    @conversion = Conversion.new(params[:conversion])

    if @conversion.save
---
INSERT INTO "conversions" ("bigger_unit_id", "conversion_factor", "created_at", "smaller_unit_id", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["bigger_unit_id", 2], ["conversion_factor", 2.54], ["created_at", Mon, 16 Jul 2012 10:02:03 SGT +08:00], ["smaller_unit_id", 1], ["updated_at", Mon, 16 Jul 2012 10:02:03 SGT +08:00]]