app/controllers/account/setup_module/inventory_setup/items_controller.rb

INSERT INTO "items" ("branch_id", "client_id", "concept_id", "cost", "created_at", "group", "is_active", "name", "quantity", "subcategory_id", "unit_id", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
  def create
    @item = Item.new(params[:item])

    if @item.save

SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", "2"]]
---
  def available_units
    @item = Item.find(params[:id])