app/controllers/account/setup_module/inventory_setup/subcategories_controller.rb

INSERT INTO "subcategories" ("category_id", "client_id", "cogs_group", "concept_id", "created_at", "description", "goal", "name", "non_inventory", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @subcategory = Subcategory.new(params[:subcategory])

    if @subcategory.save