app/controllers/account/setup_module/inventory_setup/units_controller.rb

INSERT INTO "units" ("branch_id", "client_id", "concept_id", "created_at", "name", "symbol", "unit_type", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @unit = Unit.new(params[:unit])

    if @unit.save