app/controllers/account/setup_module/sales_setup/sale_categories_controller.rb

INSERT INTO "sale_categories" ("concept_id", "created_at", "name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["concept_id", 1], ["created_at", Mon, 16 Jul 2012 09:58:44 SGT +08:00], ["name", "Food"], ["updated_at", Mon, 16 Jul 2012 09:58:44 SGT +08:00]]
---
  def create
    @sale_category = SaleCategory.new(params[:sale_category])

    if @sale_category.save