app/controllers/account/setup_module/sales_setup/servers_controller.rb

INSERT INTO "servers" ("branch_id", "created_at", "name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["branch_id", 2], ["created_at", Tue, 17 Jul 2012 17:28:25 SGT +08:00], ["name", "Joana Ignacio"], ["updated_at", Tue, 17 Jul 2012 17:28:25 SGT +08:00]]
---
  def create
    @server = Server.new(params[:server])

    if @server.save