app/controllers/account/setup_module/sales_setup/settlement_types_controller.rb

INSERT INTO "settlement_types" ("concept_id", "created_at", "deleted_at", "is_complimentary", "name", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["concept_id", 1], ["created_at", Mon, 16 Jul 2012 09:59:14 SGT +08:00], ["deleted_at", nil], ["is_complimentary", false], ["name", "GC"], ["updated_at", Mon, 16 Jul 2012 09:59:14 SGT +08:00]]
---
  def create
    @settlement_type = SettlementType.new(params[:settlement_type])

    if @settlement_type.save