app/views/account/setup_module/sales_setup/sale_categories/_form.html.erb

SELECT "concepts".* FROM "concepts"
---
  <div class="well">
	<%= sale_category_f.input :concept_id, :as => :select, :collection => Concept.accessible_by(current_ability).all.map{ |b| [ b.name, b.id ] } %>