app/views/account/inventory_module/endcounts/_form.html.erb

    <%= endcount_f.input :entry_date, :label => "As of", :as => :string, :input_html => { :value => Date.today.strftime( "%m/%d/%Y" ) } %>
    <%= endcount_f.input :branch_id, :as => :select, :collection => Branch.all.map{ |b| [ b.name, b.id ] } %>
---
SELECT "branches".* FROM "branches"