app/views/account/inventory_module/endcounts/index.html.erb

SELECT "branches".* FROM "branches" WHERE "branches"."id" = 1 LIMIT 1
---

 			  g.column :column_name => "Branch", :attribute_name => "branch_id", :custom_filter => Branch.find(:all).map{ |b| [b.name, b.id] } do |endcount|