app/views/account/setup_module/inventory_setup/subcategories/_form.html.erb

SELECT "categories".* FROM "categories"
---
  <div class="well">
	<%= subcategory_f.input :category_id, :as => :select, :collection => Category.all.map{ |b| [ b.name, b.id ] } %>