app/views/account/setup_module/inventory_setup/categories/_form.html.erb

  <div class="well">
	<%= category_f.input :concept_id, :as => :select, :collection => Concept.all.map{ |b| [ b.name, b.id ] } %>
---
SELECT "concepts".* FROM "concepts"