app/views/account/setup_module/sales_setup/servers/_form.html.erb

  <div class="well">
	<%= server_f.input :branch_id, :as => :select, :collection => Branch.all.map{ |b| [ b.name, b.id ] } %>
---
SELECT "branches".* FROM "branches"