app/views/account/purchases_module/purchases/_purchase_item_fields.html.erb

  <td>
    <%= f.input :unit_id, :as => :select, :collection => Unit.all.map{ |b| [ b.name, b.id ] } %>
---
SELECT "units".* FROM "units"